# Определить четное или нечетное число. Число вводится с клавиатуры


your_number = int(input("Введите целое число: "))
if (your_number % 2 == 0):
    print("Число ЧЕТНОЕ")
else:
    print("Число НЕЧЕТНОЕ")


    




