# Напишите функцию для умножения всех чисел в списке. Рекурсивно

??????

# # a = [1, 5, 3]
# def calcMultNumbers(a):
#     if a == []:
#         return 0
#     else:
#         mult = calcMultNumbers(a[1:])
#         mult = mult * a[0]
#         return mult
#

# mult = calcMultNumbers(a)
# print(mult)



