# Напишите функцию func () так, чтобы она могла принимать
# аргументы переменной длины и выводить все значения
# аргументов с индексом аргумента.

# ????

def add_num(*arg):
    s = list(arg)
    for i in range(len(arg)):
        s[i] += ind
    return print(s)


add_num(3, 6, 2, 6)



